[
  {
    "id": "cs",
    "value": {
      "Title": "C#",
      "Content": "C# (произносится как: <span class=\"fw-bold fst-italic\">си шарп</span>) - занимает 5 место среди языков программирования по версии Tiobe index. <br/> Этот язык программирования был разработан компанией Microsoft в 1998-2001 годах, как основной язык программирования для платформы .Net Framework, сначала предназначался для наиболее удобной разработки приложений на Windows, но позже, с созданием .Net Core, C# стал универсальным языком программирования для компьютера, телефона и всякого \"умного\" гаджета. </br> C# - самый удобный язык программирования для создания самых обыкновенных программ, а так же имеет удобные фраймворки для создания мобильных приложений, сайтов, системных служб Windows и игр (Например с помощью Unity или даже Unreal Engine, если использовать специальные модификации). К тому же C# считается довольно простым языком программирования и очень похожим на Java, но с куда большими возможностями.",
      "Homelink": "https://docs.microsoft.com/ru-ru/dotnet/csharp/",
      "Wikilink": "https://ru.wikipedia.org/wiki/C_Sharp",
      "ImageLink": "/img/lang/cs.png"
    }
  },
  {
    "id": "cpp",
    "value": {
      "Title": "C++",
      "Content": "Язык программирования С++ представляет высокоуровневый компилируемый язык программирования общего назначения со статической типизацией, который подходит для создания самых различных приложений. На сегодняшний день С++ является одним из самых популярных и распространенных языков. <br><br>С++ является мощным языком, унаследовав от Си богатые возможности по работе с памятью. Поэтому нередко С++ находит свое применение в системном программировании, в частности, при создании операционных систем, драйверов, различных утилит, антивирусов и т.д. К слову сказать, ОС Windows большей частью написана на С++.",
      "Homelink": "https://docs.microsoft.com/ru-ru/cpp/?view=msvc-170",
      "Wikilink": "https://ru.wikipedia.org/wiki/C%2B%2B",
      "ImageLink": "/img/lang/cpp.png"
    }
  },
  {
    "id": "java",
    "value": {
      "Title": "Java",
      "Content": "Java – один из самых востребованных языков программирования в мире и один из двух официальных языков программирования, используемых в разработке Android (другой – Kotlin). Разработчики, знакомые с Java, весьма востребованы и способны создавать широкий спектр различных приложений, игр и инструментов. <br><br> Java - это не только язык, это еще и платформа, обеспечивающая некоторые популярные языки программирования такие как: Kotlin, Scala, Clojure и др. Платформа Java может работать почти на каждом \"умном\" устройстве в мире, что обеспечивает гиганскую популярность этого языка программирования.",
      "Homelink": "https://www.java.com/ru/",
      "Wikilink": "https://ru.wikipedia.org/wiki/Java",
      "ImageLink": "/img/lang/java.png"
    }
  },
  {
    "id": "kotlin",
    "value": {
      "Title": "Kotlin",
      "Content": "Kotlin (Ко́тлин) — статически типизированный, объектно-ориентированный язык программирования, работающий поверх Java Virtual Machine и разрабатываемый компанией JetBrains. Также компилируется в JavaScript и в исполняемый код ряда платформ через инфраструктуру LLVM. <br> <br> Авторы ставили целью создать язык более лаконичный и типобезопасный, чем Java, и более простой, чем Scala[4]. Следствием упрощения по сравнению со Scala стали также более быстрая компиляция и лучшая поддержка языка в IDE[5]. Язык полностью совместим с Java, что позволяет Java-разработчикам постепенно перейти к его использованию; в частности, язык также встраивается Android, что позволяет для существующего Android-приложения внедрять новые функции на Kotlin без переписывания приложения целиком.",
      "Homelink": "https://kotlinlang.org/",
      "Wikilink": "https://ru.wikipedia.org/wiki/Kotlin",
      "ImageLink": "/img/lang/kotlin.svg"
    }
  },
  {
    "id": "asm",
    "value": {
      "Title": "Assembler",
      "Content": "Язык ассе́мблера (англ. assembly language) — представление команд процессора в виде, доступном для чтения человеком. Язык ассмеблера считается языком программирования низкого уровня, в противовес высокоуровневым языкам, не привязанным к конкретной реализации вычислительной системы. Программы, написанные на языке ассемблера однозначным образом переводятся в инструкции конкретного процессора и в большинстве случаев не могут быть перенесены без значительных изменений для запуска на машине с другой системой команд. На данный момент используются специальные ассемблеры, способные работать на разных системах, такие как Masm и Nasm.",
      "Homelink": "https://nasm.us/",
      "Wikilink": "https://ru.wikipedia.org/wiki/%D0%AF%D0%B7%D1%8B%D0%BA_%D0%B0%D1%81%D1%81%D0%B5%D0%BC%D0%B1%D0%BB%D0%B5%D1%80%D0%B0",
      "ImageLink": "/img/lang/asm.png"
    }
  },
  {
    "id": "js",
    "value": {
      "Title": "JavaScript",
      "Content": "JavaScript (часто просто JS) — это легковесный, интерпретируемый или JIT-компилируемый, объектно-ориентированный язык с функциями первого класса. Наиболее широкое применение находит как язык сценариев веб-страниц, но также используется и в других программных продуктах, например, node.js или Apache CouchDB.",
      "Homelink": "https://nodejs.org/en/",
      "Wikilink": "https://ru.wikipedia.org/wiki/JavaScript",
      "ImageLink": "/img/lang/js.png"
    }
  },
  {
    "id": "ts",
    "value": {
      "Title": "TypeScript",
      "Content": "TypeScript — это расширенная версия JavaScript, разработанная компанией Microsoft, главной целью которого является упрощение разработки крупных JS-приложений. Этот язык добавляет много новых принципов — классы, интерфейсы, статические типы, что позволяет разработчикам использовать разные инструменты, такие как статический анализатор или рефакторинг кода.",
      "Homelink": "https://www.typescriptlang.org/",
      "Wikilink": "https://ru.wikipedia.org/wiki/TypeScript",
      "ImageLink": "/img/lang/ts.png"
    }
  },
  {
    "id": "ruby",
    "value": {
      "Title": "Ruby",
      "Content": "Ruby впервые увидел свет в 1995 году. Разработан Юкихиро Мацумото. Изначальная задумка была создать более мощный язык, чем Perl и более объектно-ориентированный, чем Python. Ruby должен был подойти для решения простых и понятных задач, ориентированных в первую очередь на простоту и скорость разработки. На данный момент Ruby считается один из самых популярных объектно-ориентированных языков программирования, который активно используется в веб-разработке.",
      "Homelink": "https://www.ruby-lang.org/ru/",
      "Wikilink": "https://ru.wikipedia.org/wiki/Ruby",
      "ImageLink": "/img/lang/ruby.png"
    }
  },
  {
    "id": "c",
    "value": {
      "Title": "C",
      "Content": "Язык \"C\" (произносится \"си\") — это универсальный язык программирования, для которого характерны экономичность выражения, современный поток управления и структуры данных, богатый набор операторов.<br><br>Язык С нередко называют языком программирования \"среднего уровня\" или даже \"низкого уровня\", так как он сочетает элементы языков высокого уровня с функциональностью и производительностью ассемблера и работает близко к аппаратной части компьютера. В итоге мы можем манипулировать данными на низком уровне и при этом использовать высокоуровневые конструкции для управления работы программы. <br><br>Первоначально язык С предназначался для написания операционной системы Unix. Впоследствии Си стал одним из популярных языков, а его основной сферой применения стало системное программирование, в частности, создание операционных систем, драйверов, различных утилит, антивирусов и т.д. К слову сказать, Linux большей частью написан на Си.",
      "Homelink": "https://docs.microsoft.com/en-us/cpp/c-language/c-language-reference?view=msvc-160",
      "Wikilink": "https://ru.wikipedia.org/wiki/%D0%A1%D0%B8_(%D1%8F%D0%B7%D1%8B%D0%BA_%D0%BF%D1%80%D0%BE%D0%B3%D1%80%D0%B0%D0%BC%D0%BC%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D1%8F)",
      "ImageLink": "/img/lang/c.png"
    }
  },
  {
    "id": "vb",
    "value": {
      "Title": "VisualBasic",
      "Content": "VB.NET или Visual Basic .NET представляет объектно-ориентированный язык программирования от компании Microsoft, который использует бейсикоподобный синтаксис и работает на платформе Microsoft. <br> <br> Хотя VB.NET уступает по популярности таким языкам, как C++, C#, Java в силу различных причин, однако тем не менее также обладает достаточно большим потенциалом и большими возможностями. С помощью языка VB.NET можно создавать довольно широкий спектр приложений: это и простейшие консольные утилиты и графические программки, и игровые приложения, и сложные высоконагруженные веб-сервисы. Сейчас VB по большей части используется для создание скриптов Microsoft Office и других приложениях Microsoft",
      "Homelink": "https://docs.microsoft.com/ru-ru/dotnet/visual-basic/",
      "Wikilink": "https://ru.wikipedia.org/wiki/Visual_Basic",
      "ImageLink": "/img/lang/vb.png"
    }
  },
  {
    "id": "go",
    "value": {
      "Title": "Go",
      "Content": "Язык программирования Go (или Golang) разработали в Google и выпустили в 2009 году. Go — его официальное название, но для простоты поиска и выбора удачного домена придумали второе — Golang.<br><br>В Go попытались объединить скорость, характерную для C-подобных языков, и лёгкость разработки, характерную для Python. Его задумывали как универсальный, и с этой ролью он справляется, но лучше всего Golang показывает себя в разработке серверных приложений: парсеров, сложных вычислительных систем, многопоточных приложений. Используется в первую очередь в бэкенде, то есть в разработке логики приложений и сайтов.<br><br>Главная особенность Go — в его минимализме. Другие языки меняются, обрастая новыми функциями. Язык Go изначально был создан, чтобы идеально решать поставленную перед ним задачу, поэтому меняется только в сторону улучшения уже существующих инструментов, а не добавления новых.",
      "Homelink": "https://go.dev/",
      "Wikilink": "https://ru.wikipedia.org/wiki/Go",
      "ImageLink": "/img/lang/go.png"
    }
  },
  {
    "id": "swift",
    "value": {
      "Title": "Swift",
      "Content": "Swift – это новый язык программирования для разработки iOS и OS X приложений, который сочетает в себе все лучшее от C и Objective-C, но лишен ограничений, накладываемых в угоду совместимости с C. В Swift используются паттерны безопасного программирования и добавлены самые современные функции. Разрабатывает Swift сама компания Apple, что обеспечивает большое, хоть и крайне узконаправленное комьюнити программистов.",
      "Homelink": "https://www.swift.org/",
      "Wikilink": "https://ru.wikipedia.org/wiki/Swift_(%D1%8F%D0%B7%D1%8B%D0%BA_%D0%BF%D1%80%D0%BE%D0%B3%D1%80%D0%B0%D0%BC%D0%BC%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D1%8F)",
      "ImageLink": "/img/lang/swift.png"
    }
  },
  {
    "id": "php",
    "value": {
      "Title": "PHP",
      "Content": "PHP (от англ. препроцессор гипертекста) – язык программирования высокого уровня общего назначения, основная сфера применения языка PHP — это веб, то есть сайты, которые мы каждый день посещаем через браузер компьютера или смартфона. Важно понимать, что веб — это не весь интернет, а только самая большая и популярная его часть. Кроме веба через интернет работает электронная почта, мессенджеры, файлообменные сервисы, сетевые игры и многое другое. Практически каждый сайт, который есть в интернете, работает на PHP.",
      "Homelink": "https://www.php.net/",
      "Wikilink": "https://ru.wikipedia.org/wiki/PHP",
      "ImageLink": "/img/lang/php.png"
    }
  },
  {
    "id": "python",
    "value": {
      "Title": "Python",
      "Content": "Python (произносится как «пайтон», но многие говорят «питон») – это язык программирования общего назначения, который широко применяется в различных областях: от создания банальных веб-страниц до систем управления роверами на других планетах. Python имеет самое большое комьюнити среди всех языков программмирования и универсален абсолютно для всех задач, хоть и имеет весьма низкую скорость работы.",
      "Homelink": "https://python.org",
      "Wikilink": "https://ru.wikipedia.org/wiki/Python",
      "ImageLink": "/img/lang/python.png"
    }
  }
]